def all_categories() -> dict:
  categories = {
    "продукты": ["продукты", "магазин", "продуктовый", "пятёрочка",
                 "ярче", "мария", "магнит", "селф", "еда","ларёк" ],
    "кафе и рестораны": ["ресторан", "кафе", "обед", "фастфуд", "ужин", "завтрак",
                         "кофейня", "пицца", "столовая", "доставка",  "кухня" ],
    "транспорт": ["такси", "автобус", "метро", "транспорт", "самолёт"],
    "интернет и связь": ["мобильный", "интернет", "мтс", "сервис", "сети",
                         "телефон", "сервис", "билайн","мегафон", "tele2", "услуги"],
    "хобби и развлечения": ["кино", "театр", "концерт", "игры", "кинотеатр", "фильм",
                          "квест", "музыкальный", "standup", "афиша", "kassir", "читай",
                            "книжный","леонардо", "хобби", "творчество"],
    "одежда": ["одежда", "обувь", "магазин одежды", "гардероб",
               "обувной", "аксессуары", "шоурум"],
    "здоровье": ["аптека", "лекарство", "медицин", "врач",
                 "приём", "клиника", "таблетки", "мед", "доктор"],
    "спорт": ["спорт", "тренажёрка", "фитнес", "спортзал", "спортивный",
              "зал", "бассейн", "тренировка", "тренер"],
    "образование": ["курс", "учеба", "школа", "университет",
                    "репетитор", "урок", "образование"],
    "коммунальные услуги": ["комунальные","свет","коммуналка", "вода",
                            "электричество", "газ", "мусор", "отопление"],
    "депозит/инвестиции": ["клиентов", "депозит", "инвестиции","дивидент", "акция", "процент"],
    "зарплата и доходы": ["зарплата", "доход", "начисление", "стипендия",
                          "премия", "зачисление", "прибыль"],
    "погашение кредита": ["кредит", "ипотека", "погашение", "процент"],
    "подарки": ["подарок", "поздравление", "праздник", "упаковка", "шары", "подарки"],
    "налоги": ["налог", "фискальный", "налоги", "ндфл", "ндс", "пошлина"],
    "подписки": ["подписка", "подписки", "плюс", "иви", "окко", "start", "музыка", "вк"],
    "маркетплейсы": ["маркетплейс", "маркет", "wildberries", "ozon",
                            "озон", "вайлдберис"],
    "услуги": ["услуги", "красоты", "парикмахерская", "салон", "ремонт", "мастер", "клининг", ""]

  }
  return categories



def priority_categories() -> list:
  categories_priority = [
    "зарплата и доходы",
    "продукты",
    "погашение кредита",
    "депозит/инвестиции",
    "кафе и рестораны",
    "транспорт",
    "налоги",
    "интернет и связь",
    "коммунальные услуги",
    "здоровье",
    "одежда",
    "развлечения и хобби",
    "образование",
    "спорт",
    "услуги",
    "маркетплейсы",
    "подписки",
    "подарки"

  ]
  return categories_priority


def categorize_transaction_with_multiple(description: str, categories: dict, categories_priority: list) -> str:
    description_low = description.lower()
    matched_categories = []

    for category in categories_priority:
        keywords = categories.get(category, [])
        if any(keyword in description_low for keyword in keywords):
            matched_categories.append(category)


    if matched_categories:
        return matched_categories[0]
    return "другое"


def categorize_all_transactions(transactions: list) -> list:
    for transaction in transactions:
        desc = transaction.get("description", "")
        category = categorize_transaction_with_multiple(desc, all_categories(), priority_categories())
        transaction["category"] = category
    return transactions
